[
    {
      "id": "p1",
      "userUsername": "sofi@gmail.com",
      "topic": "Fuerzas",
      "title": "No entiendo cómo descomponer fuerzas en un plano inclinado con rozamiento",
      "content": "Hola! Estoy resolviendo los ejercicios del capítulo de fuerzas y siempre me trabo con lo mismo: no entiendo bien cómo descomponer el peso cuando el plano tiene ángulo y encima aparece una fuerza de rozamiento.\n\nEntiendo la teoría, pero cuando lo aplico siento que me falta un paso. ¿La normal siempre es mg·cosθ aunque haya otras fuerzas? ¿Y el rozamiento va siempre paralelo al plano?\n\nSi alguien tiene una forma más intuitiva de pensarlo o un ejemplo paso a paso se los agradecería muchísimo.",
      "tags": ["fuerzas", "plano inclinado", "rozamiento", "fisica 1"],
      "createdAt": "2025-09-01T10:15:00"
    },
    {
      "id": "p2",
      "userUsername": "sofi2@gmail.com",
      "topic": "Leyes de Newton",
      "title": "Duda con la Tercera Ley de Newton en choques",
      "content": "Buenas! Estoy estudiando para el parcial y tengo una duda que me deja re confundido:\n\nEn un choque elástico entre dos masas, ¿las fuerzas que se hacen entre sí siempre son iguales y opuestas en todo momento? O sea, ¿se cumple exactamente la Tercera Ley durante el choque mismo o solo cuando analizamos el impulso total?\n\nEn algunas simulaciones veo fuerzas distintas en distintos momentos y me perdí. Si alguien me puede explicar qué parte estoy interpretando mal, gracias 🙏.",
      "tags": ["newton", "choques", "leyes de newton"],
      "createdAt": "2025-09-01T11:40:00"
    },
    {
      "id": "p3",
      "userUsername": "sofi@gmail.com",
      "topic": "Choques",
      "title": "¿Cómo saber si un choque es realmente elástico?",
      "content": "Estoy resolviendo ejercicios del libro y algunos dicen “choque elástico”, pero en otros te lo dan implícito y no sé cómo detectarlo.\n\n¿Hay algún indicador claro?\nPor ejemplo, si la energía cinética antes y después no coincide exactamente por decimales, ¿igual lo considero elástico? Y si me dan datos de velocidades, ¿siempre uso conservación del momento + conservación de energía?\n\nSe agradece cualquier regla práctica o tips para identificarlo más rápido.",
      "tags": ["choques", "energia", "cantidad de movimiento"],
      "createdAt": "2025-09-02T09:05:00"
    },
    {
      "id": "p4",
      "userUsername": "sofi2@gmail.com",
      "topic": "Impulso",
      "title": "Problema con ejercicios de impulso y cantidad de movimiento",
      "content": "Me encontré un ejercicio donde un bloque recibe un golpe durante un intervalo corto de tiempo, y tengo que sacar la variación del momento lineal.\n\nEntiendo la fórmula F·Δt, pero el ejercicio no me da la fuerza, sino una gráfica medio rara.\n¿Alguien me explica cómo se “lee” la gráfica para obtener el impulso total?\n\nEstoy perdida, gracias!!",
      "tags": ["impulso", "graficas", "cantidad de movimiento"],
      "createdAt": "2025-09-02T13:20:00"
    },
    {
      "id": "p5",
      "userUsername": "sofi@gmail.com",
      "topic": "Choques",
      "title": "Choques frontales: ¿cómo hacer para no mezclar ecuaciones?",
      "content": "Estoy haciendo práctica de choques frontales y me pasa que mezclo fórmulas o pongo signos al revés.\n\n¿Hay alguna forma ordenada de armar siempre los pasos? Tipo:\n- definir sentidos\n- aplicar conservación del momento\n- aplicar energía cinética\n- despejar…\n\n¿O hay otra forma más intuitiva?\nSi tienen algún ejemplo resuelto simple, también me sirve para agarrar ritmo.",
      "tags": ["choques", "metodologia", "fisica 1"],
      "createdAt": "2025-09-03T16:00:00"
    }
  ]
  
  